//=================HW5==================

//Запросити у користувача рік народження.

//Запитати в нього, в якому місті він живе.

//Запитати його улюблений вид спорту.

/*При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
    Його вік.
    Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
    Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач запровадить один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.*/


//=====================================================================================

// Запросити рік народження користувача
const birthYear = prompt('Введіть свій рік народження');

// Перевірити, чи користувач ввів рік народження
if (birthYear !== null) {
  // Отримати поточний рік
    const currentYear = new Date().getFullYear();
  // Обчислити вік користувача
    const age = currentYear - birthYear;
    alert(`Твій вік ${age}`)
  // Запросити назву міста користувача
    const city = prompt('Введіть назву міста, в якому ви живете');

  // Перевірити, чи користувач ввів назву міста
  if (city !== null) {
    // Перевірити, чи користувач живе в столиці
    if (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') {
      let country = "";
      // Визначити країну залежно від столиці
      if (city === 'Київ') {
        country = 'Україна';
      } else if (city === 'Вашингтон') {
        country = 'США';
      } else if (city === 'Лондон') {
        country = 'Велика Британія';
      }
      // Вивести повідомлення про місце проживання
      alert(`Ти живеш у столиці ${country}`);
    } else {
      // Вивести повідомлення про місце проживання
      alert(`Ти живеш у місті ${city}`);
    }

    // Запросити улюблений вид спорту
    const sport = prompt('Введіть свій улюблений вид спорту');

    // Перевірити, чи користувач ввів улюблений вид спорту
    if (sport !== null) {
      // Перевірити, чи є улюблений вид спорту одним з трьох видів
      if (sport === 'бокс' || sport === 'футбол' || sport === 'хокей') {
        let champion = '';

        // Визначити чемпіона залежно від виду спорту
        if (sport === 'бокс') {
          champion = 'Олександр Усик';
        } else if (sport === 'футбол') {
          champion = 'Ліонель Мессіс';
        } else if (sport === 'хокей') {
          champion = 'Вейн Ґрецкіс';
        }

        // Вивести повідомлення про можливість стати чемпіоном
        alert(`Круто! Хочеш стати як ${champion}?`);
      } else {
        // Вивести повідомлення про улюблений вид спорту
        alert(`Твій улюблений вид спорту  ${sport} `);
      }
    } else {
      // Вивести повідомлення про відмову від введення улюбленого виду спорту
      alert(`Шкода, що Ви не захотіли ввести свій улюблений вид спорту`);
    }
  } else {
    // Вивести повідомлення про відмову від введення назви міста
    alert('Шкода, що Ви не захотіли ввести своє місто');
  }
} else {
  // Вивести повідомлення про відмову від введення року народження
  alert('Шкода, що Ви не захотіли ввести свій рік народження');
}


